<template>
  <el-dialog
    class="agreeRegister"
    title="注册协议"
    :before-close="closeDialog"
    :visible.sync="dialog"
    width="60%"
    top="8vh"
  >
    <h3>
      本协议是凯晟物联科技有限公司单一窗口服务平台网站（以下简称“本站”）与本站
      注册用户（以下简称“用户”或“您”）之间就本站服务等相关事宜所订立的契约。 本注册
      协议双方为本站注册用户和凯晟物联科技有限公司（以下简称“凯晟国际物联”或“我公司”）。
      您应在注册成为用户前充分阅读、理解本协议的全部内容，一旦勾选“我已阅读并同意服务条款 & 隐私声明”后，
      则视为您自愿签署本协议，已知悉本协议全部内容，同意接受本站的服务，并受本协议的约束。
    </h3>
    <p>
      第1条 本站服务条款的确认和接纳
      <br />1.1用户同意所有注册协议条款并完成注册程序，才能成为本站的正式用户。本协议条款是处理双方权利义务的契约，始终有效，法律另有强制性规定或双方另有特别约定的，依其规定。
      <br />1.2用户点击“我已阅读并同意服务条款 & 隐私声明”的，即视为用户确认自己具有享受本站服务等相应的权利和义务，能够独立承担法律责任。
      <br />1.3凯晟物联科技保留在中华人民共和国大陆地区法施行之法律允许的范围内独立决定拒绝服务、关闭用户账户、清除或编辑内容或取消订单的权利。
      <br />1.4 本协议包括协议目前已经载明的所有条款，同时也包括本站已经发布的或者将来发布的各类文字、图片、语音、视频所示规则。所有规则均为本协议不可分割的一部分，与本协议正文具有同等法律效力。 用户注册即视为同意凯晟物联科技在将来任何时刻有权修改、删减、增加本协议及以上所示规则的内容，该修改、删减、增加仅需采用公示方式通知，一经公布，则视 为已经通知到用户，立即自动生效。注册用户应关注本站所附本协议及其他形式所体现的规则。若用户在协议内容公告变更后继续使用本站服务的，表示用户已充分阅读、理解并接受修 改后的协议内容，用户应遵循修改后的协议内容；若用户不同意修改后的协议内容，应停止使用本站服务。凯晟物联科技不承担任何因此导致的法律责任。
      <br />1.5本协议不涉及用户与本站的其他用户之间因网上交易或使用本站服务而产生的[请公司确认是否存在网上交易等情况，律师修改供参考。]法律关系或法律纠纷，但用户在此同意将全 面接受和履行与本站其他用户在本站签订的任何电子法律文本，并承诺按该等法律文本享有和/或放弃相应的权利、承担和/或豁免相应的义务。
    </p>
    <p>
      第2条 本站服务
      <br />2.1 凯晟物联科技以互联网为依托，依法为用户提供集装箱在成都铁路口岸海关监管场所的转运、装卸、堆存及监管箱查验、熏蒸等所有通关操作业务和城厢中心站至监管区转场运输作业的 线上委托服务。用户在完全同意本协议及本站规定的情况下，方有权使用本站的相关服务。用户一旦使用本站相关服务，即视为完全同意凯晟物联科技及本站的相关规定，自愿遵守凯晟物联科技、 本站的相关制度和规章。
      <br />2.2本站上的报价、发送日期等服务信息随时都有可能发生变动，本站不作特别通知。请各用户自行关注相关服务信息内容，如因此造成的相关纠纷和损失，凯晟物联科技概不承担相关责任。
      <br />2.3基于运行和交易安全的需要，凯晟物联科技可以暂时停止提供、限制或改变本站服务的部分功能，或提供新的功能。在任何功能减少、增加或者变化时，只要用户仍然使用本站的服务， 表示用户仍然同意本协议或者变更后的协议。
      <br />2.4 用户在本站上按本站服务流程所确认的状态将成为本站为您进行相关交易或操作的明确指令。用户同意本站有权按相关指令依据本协议和/或有关文件和规则对相关事项进行处理。 若用户未能及时对状态进行修改或确认或未能提交相关申请所引起的任何纠纷或损失由用户本人负责，本站不承担任何责任/或放弃相应的权利、承担和/或豁免相应的义务。
    </p>
    <p>
      第3条 用户信息
      <br />3.1用户应自行诚信向本站提供注册资料，并保证其提供的注册资料真实、准确、完整、合法有效，若注册资料有变动的，应及时更新其注册资料。如果用户提供的注册资料不合法、 不真实、不准确、不详尽的，用户需承担因此引起的相应责任及后果，并且凯晟物联科技保留终止用户使用本站及陆港相关各项服务的权利。
      <br />3.2用户在本站进行服务订单委托等业务时，涉及到的真实姓名/名称、通信地址、联系电话、电子邮箱等隐私信息的，本站将予以严格保密，除非得到用户的授权或法律另有规定， 本站不会向外界披露用户隐私信息，本协议另有明确约定的除外。本站将采用行业标准惯例以保护用户的资料，但鉴于技术限制，本站并不能确保用户的资料不会通过本协议中未列 明的途径泄露出去，对此，用户知悉并豁免本站和凯晟物联科技的相关责任。
      <br />3.3用户注册成功后，将产生用户名和密码等账户信息，用户应谨慎合理的保存、使用其用户名和密码。用户若发现任何非法使用用户账号或存在安全漏洞的情况，请立即通知本站并向公安机关报案。
      <br />3.4用户同意，凯晟物联科技可以通过邮件、短信、电话等形式，向在本站注册、提交委托服务订单的用户确认和告知订单信息等相关信息。用户同意本站利用用户的资料与用户联络并 （在某些情况下）向用户传递针对您的兴趣而提供的信息，例如：有针对性的广告条、行政管理方面的通知、产品提供以及有关您使用本站的通讯。用户接受本协议即视为同意收取 这些资料。
      <br />3.5用户不得将在本站注册获得的账户转让、赠与或授权给第三方使用，防止用户账户信息泄露、账号被他人恶意操作。 使用该用户名和密码登录本站后在本站的一切行为均视同用 户本人行为及真实意思表示，所有法律后果由用户本人承担。因用户名或密码泄露导致的一切责任、损失等由用户本人承担，并且实际使用人承担连带责任。
      <br />3.6用户同意，陆港有权使用用户的注册信息、用户名、密码等信息，登录进入用户的注册账户，进行证据保全，包括但不限于公证、见证等。用户同意本站可使用关于用户的资料 （包括但不限于本站持有的有关用户的档案中的资料，及本站从用户目前及以前在本站上的活动所获取的其他资料，用户相关人员的个人资料等）以解决争议、对纠纷进行调停、确 保在本站进行安全交易，并执行本站的服务协议及相关规则。
      用户同意本站可以使用用户的资料（含个人资料等）以改进本站的推广和促销工作、分析网站的使用率、改善本站的内容和产品推广形式，并使本站的网站内容、设计和服务更能 符合用户的要求。这些使用能改善本站的网页，以调整本站的网页使其更能符合用户的需求，从而使用户在使用本站服务时得到更为顺利、有效、安全及度身订造的交易体验。
      <br />3.7用户使用本站服务时，即授权本站或凯晟物联科技将用户您的包括但不限于名称、联系方式、其他与服务相关的信息提供给服务相关方（包括但不限于本站为完成拟向您提供的服 务而合作的机构）。
      <br />3.8本站有义务根据有关法律要求向司法机关和政府部门提供用户的相关资料。在用户您未能按照与本协议、本站有关规则或者与本站其他用户签订的有关协议的约定履行自己应尽 的义务时，本站有权根据自己的判断、有关协议和规则、国家生效裁决文书或者与该笔交易有关的其他方的合理请求披露您的资料，本站对此不承担任何责任。
    </p>
    <p>
      第4条 用户依法言行义务
      <br />本站严禁用户利用本站从事任何违法活动，您承诺合法使用本站显示的内容及提供的服务，不违反中国现行法律、法规、政府规章及其他应该遵守的规范性文件，本站及凯晟物联科技的相 关规章制度。若用户违反本站关于行为合法性的规定，所产生的一切法律后果与本站无关，均由用户自行承担。本协议依据国家相关法律法规规章制定，用户同意严格遵守以下义务：
      <br />4.1不得传输或发表：煽动抗拒、破坏宪法和法律、行政法规实施的言论，煽动颠覆国家政权，推翻社会主义制度的言论，煽动分裂国家、破坏国家统一的的言论，煽动民族仇恨、 民族歧视、破坏民族团结的言论；
      <br />4.2从中国大陆向境外传输资料信息时必须符合中国有关法规；
      <br />4.3不得利用本站从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动；
      <br />4.4不得干扰本站的正常运转，不得侵入本站及国家计算机信息系统；
      <br />4.5不得传输或发表任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的，淫秽的、不文明的等信息资料；
      <br />4.6不得传输或发表损害国家社会公共利益和涉及国家安全的信息资料或言论；
      <br />4.7不得教唆他人从事本条所禁止的行为；
      <br />4.8不得利用在本站注册的账户进行牟利性经营活动；
      <br />4.9不得发布任何侵犯他人著作权、商标权等知识产权或合法权利的内容；
      用户应不时关注并遵守本站不时公布或修改的各类合法规则规定，本站保有删除站内各类不符合法律政策或不真实的信息内容而无须通知用户的权利。
      若用户未遵守以上规定的，本站有权作出独立判断并采取暂停或关闭用户帐号等措施。用户须对自己在网上的言论和行为承担法律责任。
    </p>
    <p>
      第5条 用户委托服务
      <br />5.1用户集装箱委托进场操作的，应至少提前1小时在本本站上提出作业需求，包括箱型、数量、箱号、品名、进场时间、场站作业项目、联系人、电话等有关信息，并对信息的真实性、完整性和有效性负责。因用户未能在规定时间内提供上 述信息而造成的后果，由用户自行承担，造成凯晟物联科技损失的，由用户承担赔偿责任；单证操作中如需变更相关数据，须在系统中向单证中心提交申请，并由单证中心申请至海关。待海关同意后，回传运抵报告方可变更；否则，不能更改。 若擅自随意变更数据，导致一切数据异常和经济损失，用户自行承担，造成凯晟物联科技损失的，由用户承担赔偿责任。
      <br />5.2用户铁路到达的集装箱委托由凯晟物联科技汇总提票，需另签订汇总提票《委托书》；由凯晟物联科技到集装箱中心站代为提取收货人为用户的海关监管到达集装箱票据及货物，并提供集装箱操作相关业务（未委托汇总提票的，应提前1小时向乙 方提供《铁路到达提箱委托书》并移交集装箱中心站交付的货物运单。如因用户未及时办理相关手续造成的相关责任后果由用户自行承担）；
      <br />5.3涉及场站操作之外服务项目的，根据用户具体业务需求双方共同确定合作方式，并根据实际情况签订合作协议或补充协议。
      <br />5.4用户应保证进场集装箱内的货物装载均衡、稳固，不偏载、不偏重、不超重，不违反集装箱运输的法律法规及行业规定，货物中不得夹带危险品、违禁品。但凡违规操作，用户承担一切后果，并赔偿由此给凯晟物联科技造成的损失。
      <br />5.5用户集装箱所装货物应符合所用箱型适箱货物要求，不得腐蚀、损坏箱体，不得匿报、谎报货物品名、性质、重量，不得使用超过铁路运输年限的集装箱、报废箱，用户对违反规定所造成的后果自行承担，并赔偿由此给凯晟物联科技造成的损 失。
      <br />5.6用户在提取空、重箱时，应提前通知陆港放箱，并办理提箱前的相关手续，用户凭凯晟物联科技出具的放箱手续放行，并在现场进行集装箱的交接。
      <br />5.7若用户有特殊的操作要求，须至少提前1日书面告知凯晟物联科技。
      <br />5.8 有关委托服务，若本协议与用户与凯晟物联科技签署相关书面委托服务协议不一致的，以该协议为准；本协议未涉及的，按用户与凯晟物联科技签署的相关委托服务协议为准。请公司确认是否存在在服务平台签署除本协议以外的电子协议的情况， 另外是否存在本协议与双方另行签署的服务协议不一致的的情况，若不一致，具体的处理方法，请公司核实，律师修改供参考。建议本协议中主要涉及网站使用的相关协议，若涉及具体的委托服务内容的，建议在其他文件中约定。最终由公司 确定。
    </p>
    <p>
      第6条 关务、费用结算服务
      <br />6.1 用户必须遵守报关平台请公司确认是否指本站，如是则建议统一称谓；如不是，则建议对报关平台的定义进行说明。相关管理规定，在规定的时间节点内将报关资料上传到信息平台请公司确认是否指本站，如是则建议统一称谓；如不是， 则建议对报关平台的定义进行说明。上，必须保证上传的电子资料真实无误、且需保证提供的电子资料无偷税、漏税、走私等违规违法行为。同时应按照海关及检验检疫要求提供相关资料，如因用户提供的电子资料错误导致无法通关、通检及 提箱，产生一切后果均由用户自行承担。
      <br />6.2 费用结算：双方采用电子计费方式结算场站操作费用。用户提箱前，我公司将通过本站出具计费联单且第一时间推送至用户处，用户应当及时核对费用，核对无误后签章回传。如因用户未及时确认费用导致无法提箱，产生一切后果均由 用户自行承担。 用户于线上确认费用后，月结客户应在次月初将应支付费用转存我司账户。现金客户应现场通过转账或现金的方式支付费用。若产生缴费滞后问题，我公司有权滞后提箱，待费用缴纳完毕后，方可提箱出场。因此产生一切后 果均由用户自行承担。
    </p>
    <p>
      第7条 违约责任
      <br />7.1因用户违约、未及时结算付款或其他用户原因导致运输延误及产生的滞留费、货物毁损等，相关责任后果均由用户自行承担，由此给凯晟物联科技造成损失的，用户应当承担损失赔偿责任。
      <br />7.3用户违反凯晟物联科技有关集装箱操作业务相关规章制度的，视为用户违约，陆港有权单方面解除本协议，由此给凯晟物联科技造成损失的，用户应当承担损失赔偿责任。
      <br />7.3任何一方违反本协议规定的义务，给对方造成损失的都应当承担赔偿责任，包括但不限于守约方因追究违约方违约责任而产生的提存费用、公证费用、诉讼费用、律师费用等。
      <br />7.4用户与凯晟物联科技另行签订的书面合同与本协议内容不一致的，以双方另行签订的书面协议约定为准。
    </p>
    <p>
      第8条 知识产权保护条款
      <br />本站中的所有内容均属于本公司所有,包括但不限于文本、数据、文章、设计、源代码、软件、图片、照片、音频、视频及其他全部信息。本站内容受中华人民共和国著作权法及各国际版权公约的保护。 未经本公司事先书面同意,用户承诺不以任何形式复制、模仿、传播、出版、公布、展示网站内 容,包括但不限于电子的、机械的、复印的、录音录像的方式和形式等。用户承认网站内容是属于凯晟物联科技的财产。 未经凯晟物联科技书面同意,用户不得将本站包含的资料等任何内容镜像到任何其他网站或者服务器。任何未经授权对网站内容的使用均属于违法行为,凯晟物联科技将追究相关行为方的法律责任.
    </p>
    <p>
      第9条 免责条款
      <br />9.1因不可抗力以及国家法律政策调整等因素导致本协议无法履行或无必要继续履行的，双方互不承担违约责任、赔偿责任。
      <br />9.2若遇其他意外事由，经双方协商同意并且达成书面补充合同，可以互不承担违约责任。
    </p>
    <p>
      第10条 其它条款
      <br />10.1服务变更、中断或终止。如因系统维护或升级的需要而需暂停网络服务，凯晟物联科技将进行通告，请用户自行密切关注相关信息。
      <br />10.2如发生下列任何一种情形，凯晟物联科技有权随时中断或终止向用户提供本协议项下的网络服务而无需通知用户：
      <br />（a）用户提供的个人资料不真实；
      <br />（b）用户违反本协议中规定的使用规则。
      <br />10.3除前款所述情形外，凯晟物联科技同时保留在不事先通知用户的情况下随时中断或终止部分或全部网络服务的权利，对于所有服务的中断或终止而造成的任何损失，陆港无需对用户或任何第三方承担任何责任。
      <br />10.4如果本站发现了因系统故障或其他原因导致的处理错误，无论有利于本站还是有利于用户，本站都有权在根据本协议规定通知用户后纠正该错误，但本站不承担因前述处理错误而导致的任何损失或责任。在任何情况下，对于用户使用本站服务过程中涉及由第三方提供相关服务的责任由该第三方承担， 本站不承担该等责任。因用户自身的原因导致本站服务无法提供或提供时发生任何错误而产生的任何损失或责任，由用户自行负责，本站不承担责任。
    </p>
    <span slot="footer" class="dialog-footer">
      <el-button type="primary" @click="closeDialog">确 定</el-button>
    </span>
  </el-dialog>
</template>

<script>
export default {
  props: {
    dialog: Boolean
  },
  data () {
    return {}
  },
  methods: {
    closeDialog () {
      this.$emit('close-dialogStatus')
    }
  }
}
</script>
<style lang="scss" scoped>
/deep/ .el-dialog__header {
  padding: 40px 30px 0 30px;
  >>> .el-dialog__title {
    font-size: 30px;
    font-weight: 600;
  }
}

/deep/ .el-dialog__body {
  padding: 30px 30px 10px 30px;
  line-height: 1.5;
}
</style>
